
public class test5 {

}
/*


1. Class 정의와 작성법에 대해서 서술하시오.
객체의 특성을 정의해 놓은 틀(설계도)
[접근제한자] [예약어] class 클래스명 {}

2. 접근제한자의 종류와 제한 범위를 서술하세요.
public : 전체
protected : 패키지 + 후손 클래스
(default) : 패키지
private : 해당 클래스



3. static이란 무엇인지 서술하세요.

4. final 예약어의 필드, 메서드, 클래스별 의미를 서술하세요.

5. 생성자의 정의와 작성 방법을 서술하세요.

6. 컴파일러가 컴파일 시 자동으로 추가해주는 구문을 3가지 이상 작성하세요.

7. this 참조 변수, this 생성자에 대해서 서술하세요.

8. return 예약어의 의미를 서술하세요.

9. 객체 배열이란 무엇인지 서술하세요.

10. 객체 지향 언어의 특징 중 상속에의 정의를 서술하세요.

11. 상속의 장점 3가지를 서술하세요.

12. super 참조 변수, super() 생성자에 대해서 서술하세요.

13. 오버로딩, 오버라이딩의 차이점을 서술하세요.

14. 객체 지향언어의 특징 중 다형성의 정의를 서술하세요.

15. 다형성의 업 캐스팅, 다운 캐스팅에 대해서 서술하세요.

17. 추상 메서드에 대해서 서술하세요.

18. 추상클래스와 인터페이스의 차이점을 서술하세요.

19. 예외, 예외 처리에 대해서 서술하세요.

20. 에러의 정의와 종류를 서술하세요.

21. Checked Exception, Unchecked Exception에 대해서 서술하세요.

22. 예외 처리 방법 2가지를 서술하세요.

23. 컬렉션의 종류 3가지와 특징을 서술하세요.

24. Stream이란 무엇인지 서술하세요.

25. 서버와 클라이언트에 대해서 서술하세요.

26. IP와 Port에 대해서 서술하세요.

27. Socket에 대해서 서술하세요.

28. 프로토콜의 정의를 서술하세요.

29. TCP에 대해서 서술하세요.

30. UDP에 대해서 서술하세요.










*/